## SQL Queries Results Validation

### Product Sales Volume

#### SQL Query & Results

You can check the SQL query in *01_product_sales_volume.sql* file.  

Results: 
1.	The Original Mr. Fuzzy:	**24226**
2.	The Forever Love Bear:	**5796**
4.	The Hudson River Mini bear:	**5018**
3.	The Birthday Sugar Panda:	**4985**

#### Python Validation

In [2]:
import pandas as pd

In [8]:
pruchased_items = pd.read_csv(r"d:\Data Analysis Learning\Portfolio Projects\toy-store-ecommerce-analysis\Toy Store E-Commerce Database\order_items.csv")
products = pd.read_csv(r"d:\Data Analysis Learning\Portfolio Projects\toy-store-ecommerce-analysis\Toy Store E-Commerce Database\products.csv")

In [12]:
product_sales = pd.merge(pruchased_items, products, left_on='product_id', right_on='product_id', how='left', suffixes=('_i','_p'))
product_sales

,order_item_id,created_at_i,order_id,product_id,is_primary_item,price_usd,cogs_usd,created_at_p,product_name
0,1,2012-03-19 10:42:46,1,1,1,49.99,19.49,2012-03-19 08:00:00,The Original Mr. Fuzzy
1,2,2012-03-19 19:27:37,2,1,1,49.99,19.49,2012-03-19 08:00:00,The Original Mr. Fuzzy
2,3,2012-03-20 06:44:45,3,1,1,49.99,19.49,2012-03-19 08:00:00,The Original Mr. Fuzzy
3,4,2012-03-20 09:41:45,4,1,1,49.99,19.49,2012-03-19 08:00:00,The Original Mr. Fuzzy
4,5,2012-03-20 11:28:15,5,1,1,49.99,19.49,2012-03-19 08:00:00,The Original Mr. Fuzzy
...,...,...,...,...,...,...,...,...,...
40020,40021,2015-03-19 04:10:43,32310,4,1,29.99,9.49,2014-02-05 10:00:00,The Hudson River Mini bear
40021,40022,2015-03-19 05:27:28,32311,2,1,59.99,22.49,2013-01-06 13:00:00,The Forever Love Bear
40022,40023,2015-03-19 05:27:28,32311,4,0,29.99,9.49,2014-02-05 10:00:00,The Hudson River Mini bear
40023,40024,2015-03-19 05:35:57,32312,4,1,29.99,9.49,2014-02-05 10:00:00,The Hudson River Mini bear
40024,40025,2015-03-19 05:38:31,32313,1,1,49.99,19.49,2012-03-19 08:00:00,The Original Mr. Fuzzy

In [ ]:
product_sales.groupby(['product_id', 'product_name'])['product_id'].count().sort_values(ascending=False)
# Just same results as this founded with SQL ✅

product_id  product_name
1           The Original Mr. Fuzzy        24226
2           The Forever Love Bear          5796
4           The Hudson River Mini bear     5018
3           The Birthday Sugar Panda       4985
Name: product_id, dtype: int64

### Product Revenue

#### SQL Query & Results

You can check the SQL query in *02_product_revenue.sql* file.

Results:
1.	The Original Mr. Fuzzy: **$1,211,058**
2.	The Forever Love Bear: **$347,702**
3.	The Birthday Sugar Panda: **$229,260**
4.	The Hudson River Mini bear: **$150,490**

#### Python Validation

In [26]:
product_revenue = product_sales.groupby(['product_id', 'product_name']).agg({'product_id' : 'count', 'price_usd' : 'mean'})

In [40]:
product_revenue.columns = ['count', 'price_usd', 'revenue']
product_revenue['revenue'] = round(product_revenue['count'] * product_revenue['price_usd'], 0)

In [ ]:
product_revenue
# Validate results ✅

                                       count  price_usd    revenue
product_id product_name
1          The Original Mr. Fuzzy      24226      49.99  1211058.0
2          The Forever Love Bear        5796      59.99   347702.0
3          The Birthday Sugar Panda     4985      45.99   229260.0
4          The Hudson River Mini bear   5018      29.99   150490.0

### Product Profitability

#### SQL Query & Results

You can check the SQL query in *03_product_profitability.sql* file. 

Results:
1.	The Original Mr. Fuzzy: **$738,893** (61.01% margin)
2.	The Forever Love Bear: **$217,350** (62.51% margin)
3.	The Birthday Sugar Panda: **$157,028** (68.49% margin)
4.	The Hudson River Mini bear: **$102,869** (68.36% margin)

#### Python Validation

In [50]:
product_profitability = product_sales.groupby(['product_id', 'product_name']).agg({'product_id' : 'count', 'price_usd': 'mean', 'cogs_usd' : 'mean'})

In [51]:
product_profitability.columns = ['count', 'price_usd', 'cogs_usd']

In [57]:
product_profitability['profit'] = product_profitability['count'] * (product_profitability['price_usd'] - product_profitability['cogs_usd'])
product_profitability['margin%'] = round(product_profitability['profit'] * 100 / product_revenue['revenue'], 2)

In [59]:
product_profitability
# Validate result ✅

,,count,price_usd,cogs_usd,profit,margin%
product_id,product_name,,,,,
1,The Original Mr. Fuzzy,24226,49.99,19.49,738893.0,61.01
2,The Forever Love Bear,5796,59.99,22.49,217350.0,62.51
3,The Birthday Sugar Panda,4985,45.99,14.49,157027.5,68.49
4,The Hudson River Mini bear,5018,29.99,9.49,102869.0,68.36

### Primary VS Secondary Items

#### SQL Query & Results

You can check the SQL query in *04_primary_vs_secondary_items.sql* file.  
Results: 
* Primary vs Secondary Items Distribution:
  * Primary items: **80.73%**	
  * Secondary items: **19.27%**

* Bundle Size Distribution:
	items_count	percentage
1. bundle size:1	
   - items count: **24601**	
   - percentage: **61.46%**
2. bundle size:2
   - items count: **15424**	
   - percentage: **38.54%**

#### Python Validation

In [64]:
round(pruchased_items['is_primary_item'].value_counts() * 100/ pruchased_items['is_primary_item'].count(), 2)
# Validate result ✅

is_primary_item
1    80.73
0    19.27
Name: count, dtype: float64

In [72]:
orders = pd.read_csv(r"d:\Data Analysis Learning\Portfolio Projects\toy-store-ecommerce-analysis\Toy Store E-Commerce Database\orders.csv")
bundle_items = pd.merge(pruchased_items, orders, left_on='order_id', right_on='order_id', how='left')

In [88]:
bundle_size = pd.DataFrame(bundle_items.groupby(['items_purchased'])['order_item_id'].count())
bundle_size.columns = ['order_items_count']
bundle_size['percent'] = round(bundle_size['order_items_count'] * 100 / bundle_size['order_items_count'].sum(), 2)

In [89]:
bundle_size
# Finally, validate result ✅

                 order_items_count  percent
items_purchased
1                            24601    61.46
2                            15424    38.54

### Results Summary

All validation processes on our four SQL analysis came with the same result, that is for each single analysis the findings from python is just the same SQL ones (100% Valid ✅)

So we should consider that our analysis insights are accurate.